CSI API ETABS v1

# cSapModelGetPresentUnits Method

---

Returns a value from the eUnits
enumeration indicating the units presently specified for the model.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    eUnits GetPresentUnits()

    Function GetPresentUnits As eUnits

    Dim instance As cSapModel
    Dim returnValue As eUnits

    returnValue = instance.GetPresentUnits()

    eUnits GetPresentUnits()

    abstract GetPresentUnits : unit -> eUnits

#### Return Value

Type: eUnits
Returns a value from the eUnits
enumeration if successful, otherwise returns zero.

Remarks

Examples

VB

Copy

    Public Sub Example()
           Dim SapModel As cSapModel
           Dim EtabsObject As cOAPI
           Dim ret As Integer = -1

       'create ETABS object
           Dim myHelper as cHelper = New Helper
           EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

       'start ETABS application
           ret = EtabsObject.ApplicationStart()

       'create SapModel object
           SapModel = EtabsObject.SapModel

       'initialize model
           ret = SapModel.InitializeNewModel()

       'create steel deck template model
           ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)

       'get present units
           Dim presentUnits as eUnits
           presentUnits = SapModel.GetPresentUnits()

       'run model (this will create the analysis model)
           ret = SapModel.Analyze.RunAnalysis

       'close ETABS
           EtabsObject.ApplicationExit(False)

       'clean up variables
           SapModel = Nothing
           EtabsObject = Nothing
       End Sub

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com